In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\loges\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\loges\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\loges\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\loges\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\loges\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\loges\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd

In [2]:
#read csv file
dataA = pd.read_csv(r"C:\PARTHI\PROJECT - 2\Customers.csv", encoding="latin1")

NameError: name 'pd' is not defined

In [4]:
dataA

,CustomerKey,Gender,Name,City,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,Victoria,3698,Australia,Australia,11/19/1965
...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa DuÂkovÃ¡,Houston,Texas,77017,United States,North America,3/25/1936
15262,2099618,Male,Justin SolÃ³rzano,Mclean,Virginia,22101,United States,North America,2/16/1992
15263,2099758,Male,Svend Petrussen,Wilmington,North Carolina,28405,United States,North America,11/9/1937
15264,2099862,Female,Lorenza Rush,Riverside,California,92501,United States,North America,10/12/1937
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,Michigan,48302,United States,North America,8/18/1965

In [5]:
dataA.isnull().sum()

CustomerKey    0
Gender         0
Name           0
City           0
State          0
Zip Code       0
Country        0
Continent      0
Birthday       0
dtype: int64

In [6]:
# Check for missing values
missing_values = dataA.isnull().sum()

# Display columns with missing values
print(missing_values[missing_values > 0])

Series([], dtype: int64)

In [7]:
# Drop the 'StateCode' column permanently
dataA = dataA.drop(columns=['State Code'])

KeyError: "['State Code'] not found in axis"

In [8]:
# Verify the column is removed
print(dataA.head())

   CustomerKey  Gender               Name            City              State  \
0          301  Female      Lilly Harding  WANDEARAH EAST    South Australia
1          325  Female       Madison Hull      MOUNT BUDD  Western Australia
2          554  Female      Claire Ferres       WINJALLOK           Victoria
3          786    Male  Jai Poltpalingada    MIDDLE RIVER    South Australia
4         1042    Male    Aidan Pankhurst   TAWONGA SOUTH           Victoria

  Zip Code    Country  Continent    Birthday
0     5523  Australia  Australia    7/3/1939
1     6522  Australia  Australia   9/27/1979
2     3380  Australia  Australia   5/26/1947
3     5223  Australia  Australia   9/17/1957
4     3698  Australia  Australia  11/19/1965

In [9]:
#to modify the csv file
dataA.to_csv(r"C:\PARTHI\PROJECT - 2\Customers.csv", index=False)

In [10]:
dataA

,CustomerKey,Gender,Name,City,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,Victoria,3698,Australia,Australia,11/19/1965
...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa DuÂkovÃ¡,Houston,Texas,77017,United States,North America,3/25/1936
15262,2099618,Male,Justin SolÃ³rzano,Mclean,Virginia,22101,United States,North America,2/16/1992
15263,2099758,Male,Svend Petrussen,Wilmington,North Carolina,28405,United States,North America,11/9/1937
15264,2099862,Female,Lorenza Rush,Riverside,California,92501,United States,North America,10/12/1937
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,Michigan,48302,United States,North America,8/18/1965

In [11]:
#dulicates
print(dataA.duplicated().sum())

0

In [12]:
#changes the name column to lower cases
dataA['Name'] = dataA['Name'].str.lower()

In [13]:
dataA['City'] = dataA['City'].str.lower()

In [14]:
dataA['State'] = dataA['State'].str.lower()
dataA['Country '] = dataA['Country'].str.lower()
dataA['Continent'] = dataA['Continent'].str.lower()
dataA['Gender'] = dataA['Gender'].str.lower()

In [15]:
#formats dates correctly
dataA['Birthday'] = pd.to_datetime(dataA['Birthday'], errors='coerce')

In [16]:
#ensures consistent categorical values
dataA['State'] = dataA['State'].str.strip().str.title()
dataA['Name'] = dataA['Name'].str.strip().str.title()
dataA['Country'] = dataA['Country'].str.strip().str.title()
dataA['Continent'] = dataA['Continent'].str.strip().str.title()
dataA['Gender'] = dataA['Gender'].str.strip().str.title()
dataA['City'] = dataA['City'].str.strip().str.title()
dataA['Country'] = dataA['Country'].str.strip().str.title()

In [17]:
dataA

,CustomerKey,Gender,Name,City,State,Zip Code,Country,Continent,Birthday,Country
0,301,Female,Lilly Harding,Wandearah East,South Australia,5523,Australia,Australia,1939-07-03,australia
1,325,Female,Madison Hull,Mount Budd,Western Australia,6522,Australia,Australia,1979-09-27,australia
2,554,Female,Claire Ferres,Winjallok,Victoria,3380,Australia,Australia,1947-05-26,australia
3,786,Male,Jai Poltpalingada,Middle River,South Australia,5223,Australia,Australia,1957-09-17,australia
4,1042,Male,Aidan Pankhurst,Tawonga South,Victoria,3698,Australia,Australia,1965-11-19,australia
...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa DuâKovã¡,Houston,Texas,77017,United States,North America,1936-03-25,united states
15262,2099618,Male,Justin Solã³Rzano,Mclean,Virginia,22101,United States,North America,1992-02-16,united states
15263,2099758,Male,Svend Petrussen,Wilmington,North Carolina,28405,United States,North America,1937-11-09,united states
15264,2099862,Female,Lorenza Rush,Riverside,California,92501,United States,North America,1937-10-12,united states
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,Michigan,48302,United States,North America,1965-08-18,united states

In [40]:
# Find duplicate columns manually
duplicate_cols = []
for col in dataA.columns:
    for other_col in dataA.columns:
        if col != other_col and dataA[col].equals(dataA[other_col]):
            duplicate_cols.append((col, other_col))

print(duplicate_cols)

[]

In [18]:
# Transpose, find duplicates, and drop them
dataA = dataA.loc[:, ~dataA.T.duplicated()]

# Verify the result
print(dataA.head())

   CustomerKey  Gender               Name            City              State  \
0          301  Female      Lilly Harding  Wandearah East    South Australia
1          325  Female       Madison Hull      Mount Budd  Western Australia
2          554  Female      Claire Ferres       Winjallok           Victoria
3          786    Male  Jai Poltpalingada    Middle River    South Australia
4         1042    Male    Aidan Pankhurst   Tawonga South           Victoria

  Zip Code    Country  Continent   Birthday   Country
0     5523  Australia  Australia 1939-07-03  australia
1     6522  Australia  Australia 1979-09-27  australia
2     3380  Australia  Australia 1947-05-26  australia
3     5223  Australia  Australia 1957-09-17  australia
4     3698  Australia  Australia 1965-11-19  australia

In [19]:
dataA

,CustomerKey,Gender,Name,City,State,Zip Code,Country,Continent,Birthday,Country
0,301,Female,Lilly Harding,Wandearah East,South Australia,5523,Australia,Australia,1939-07-03,australia
1,325,Female,Madison Hull,Mount Budd,Western Australia,6522,Australia,Australia,1979-09-27,australia
2,554,Female,Claire Ferres,Winjallok,Victoria,3380,Australia,Australia,1947-05-26,australia
3,786,Male,Jai Poltpalingada,Middle River,South Australia,5223,Australia,Australia,1957-09-17,australia
4,1042,Male,Aidan Pankhurst,Tawonga South,Victoria,3698,Australia,Australia,1965-11-19,australia
...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa DuâKovã¡,Houston,Texas,77017,United States,North America,1936-03-25,united states
15262,2099618,Male,Justin Solã³Rzano,Mclean,Virginia,22101,United States,North America,1992-02-16,united states
15263,2099758,Male,Svend Petrussen,Wilmington,North Carolina,28405,United States,North America,1937-11-09,united states
15264,2099862,Female,Lorenza Rush,Riverside,California,92501,United States,North America,1937-10-12,united states
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,Michigan,48302,United States,North America,1965-08-18,united states

In [20]:
# Function to check if all values in a column are lowercase
def is_lowercase_column(col):
    return dataA[col].dropna().astype(str).apply(lambda x: x.islower()).all()

# Find columns where all values are lowercase
lowercase_columns = [col for col in dataA.columns if is_lowercase_column(col)]

# Drop these columns
dataA = dataA.drop(columns=lowercase_columns)

# Print remaining columns
print("Remaining columns:", dataA.columns)

Remaining columns: Index(['CustomerKey', 'Gender', 'Name', 'City', 'State', 'Zip Code', 'Country',
       'Continent', 'Birthday'],
      dtype='object')

In [21]:
dataA

,CustomerKey,Gender,Name,City,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,Wandearah East,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,Mount Budd,Western Australia,6522,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,Winjallok,Victoria,3380,Australia,Australia,1947-05-26
3,786,Male,Jai Poltpalingada,Middle River,South Australia,5223,Australia,Australia,1957-09-17
4,1042,Male,Aidan Pankhurst,Tawonga South,Victoria,3698,Australia,Australia,1965-11-19
...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa DuâKovã¡,Houston,Texas,77017,United States,North America,1936-03-25
15262,2099618,Male,Justin Solã³Rzano,Mclean,Virginia,22101,United States,North America,1992-02-16
15263,2099758,Male,Svend Petrussen,Wilmington,North Carolina,28405,United States,North America,1937-11-09
15264,2099862,Female,Lorenza Rush,Riverside,California,92501,United States,North America,1937-10-12
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,Michigan,48302,United States,North America,1965-08-18

In [22]:
dataA.isnull().sum()

CustomerKey    0
Gender         0
Name           0
City           0
State          0
Zip Code       0
Country        0
Continent      0
Birthday       0
dtype: int64

In [25]:
dataA.to_csv(r"C:\PARTHI\PROJECT - 2\Customers.csv", index=False)

In [24]:
dataA

,CustomerKey,Gender,Name,City,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,Wandearah East,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,Mount Budd,Western Australia,6522,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,Winjallok,Victoria,3380,Australia,Australia,1947-05-26
3,786,Male,Jai Poltpalingada,Middle River,South Australia,5223,Australia,Australia,1957-09-17
4,1042,Male,Aidan Pankhurst,Tawonga South,Victoria,3698,Australia,Australia,1965-11-19
...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa DuâKovã¡,Houston,Texas,77017,United States,North America,1936-03-25
15262,2099618,Male,Justin Solã³Rzano,Mclean,Virginia,22101,United States,North America,1992-02-16
15263,2099758,Male,Svend Petrussen,Wilmington,North Carolina,28405,United States,North America,1937-11-09
15264,2099862,Female,Lorenza Rush,Riverside,California,92501,United States,North America,1937-10-12
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,Michigan,48302,United States,North America,1965-08-18

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\loges\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\loges\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\loges\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\loges\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\loges\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\loges\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

In [4]:
#read csv file
dataB = pd.read_csv(r"C:\PARTHI\PROJECT - 2\Data_Dictionary.csv", encoding="latin1")

In [5]:
dataB

,Table,Field,Description
0,Sales,Order Number,Unique ID for each order
1,Sales,Line Item,Identifies individual products purchased as pa...
2,Sales,Order Date,Date the order was placed
3,Sales,Delivery Date,Date the order was delivered
4,Sales,CustomerKey,Unique key identifying which customer placed t...
5,Sales,StoreKey,Unique key identifying which store processed t...
6,Sales,ProductKey,Unique key identifying which product was purch...
7,Sales,Quantity,Number of items purchased
8,Sales,Currency Code,Currency used to process the order
9,Customers,CustomerKey,Primary key to identify customers
10,Customers,Gender,Customer gender
11,Customers,Name,Customer full name
12,Customers,City,Customer city
13,Customers,State Code,Customer state (abbreviated)
14,Customers,State,Customer state (full)
15,Customers,Zip Code,Customer zip code
16,Customers,Country,Customer country
17,Customers,Continent,Customer continent
18,Customers,Birthday,Customer date of birth
19,Products,ProductKey,Primary key to identify products
20,Products,Product Name,Product name
21,Products,Brand,Product brand
22,Products,Color,Product color
23,Products,Unit Cost USD,Cost to produce the product in USD
24,Products,Unit Price USD,Product list price in USD
25,Products,SubcategoryKey,Key to identify product subcategories
26,Products,Subcategory,Product subcategory name
27,Products,CategoryKey,Key to identify product categories
28,Products,Category,Product category name
29,Stores,StoreKey,Primary key to identify stores
30,Stores,Country,Store country
31,Stores,State,Store state
32,Stores,Square Meters,Store footprint in square meters
33,Stores,Open Date,Store open date
34,Exchange Rates,Date,Date
35,Exchange Rates,Currency,Currency code
36,Exchange Rates,Exchange,Exchange rate compared to USD

In [6]:
print(dataB.isnull().sum())

Table          0
Field          0
Description    0
dtype: int64

In [7]:
dataB["Table"]=dataB["Table"].str.lower()
dataB["Field"]=dataB["Field"].str.lower()
dataB["Description"]=dataB["Description"].str.lower()

In [8]:
dataB

,Table,Field,Description
0,sales,order number,unique id for each order
1,sales,line item,identifies individual products purchased as pa...
2,sales,order date,date the order was placed
3,sales,delivery date,date the order was delivered
4,sales,customerkey,unique key identifying which customer placed t...
5,sales,storekey,unique key identifying which store processed t...
6,sales,productkey,unique key identifying which product was purch...
7,sales,quantity,number of items purchased
8,sales,currency code,currency used to process the order
9,customers,customerkey,primary key to identify customers
10,customers,gender,customer gender
11,customers,name,customer full name
12,customers,city,customer city
13,customers,state code,customer state (abbreviated)
14,customers,state,customer state (full)
15,customers,zip code,customer zip code
16,customers,country,customer country
17,customers,continent,customer continent
18,customers,birthday,customer date of birth
19,products,productkey,primary key to identify products
20,products,product name,product name
21,products,brand,product brand
22,products,color,product color
23,products,unit cost usd,cost to produce the product in usd
24,products,unit price usd,product list price in usd
25,products,subcategorykey,key to identify product subcategories
26,products,subcategory,product subcategory name
27,products,categorykey,key to identify product categories
28,products,category,product category name
29,stores,storekey,primary key to identify stores
30,stores,country,store country
31,stores,state,store state
32,stores,square meters,store footprint in square meters
33,stores,open date,store open date
34,exchange rates,date,date
35,exchange rates,currency,currency code
36,exchange rates,exchange,exchange rate compared to usd

In [9]:
dataB["Table"]=dataB["Table"].str.strip()
dataB["Table"]=dataB["Table"].str.replace(r"[^a-zA-Z0-9_ ]","",regex=True)
dataB["Field"]=dataB["Field"].str.strip()
dataB["Field"]=dataB["Field"].str.replace(r"[^a-zA-Z0-9_ ]","",regex=True)
dataB["Description"]=dataB["Description"].str.strip()
dataB["Description"]=dataB["Description"].str.replace(r"[^a-zA-Z0-9_ ]","",regex=True)

In [10]:
dataB

,Table,Field,Description
0,sales,order number,unique id for each order
1,sales,line item,identifies individual products purchased as pa...
2,sales,order date,date the order was placed
3,sales,delivery date,date the order was delivered
4,sales,customerkey,unique key identifying which customer placed t...
5,sales,storekey,unique key identifying which store processed t...
6,sales,productkey,unique key identifying which product was purch...
7,sales,quantity,number of items purchased
8,sales,currency code,currency used to process the order
9,customers,customerkey,primary key to identify customers
10,customers,gender,customer gender
11,customers,name,customer full name
12,customers,city,customer city
13,customers,state code,customer state abbreviated
14,customers,state,customer state full
15,customers,zip code,customer zip code
16,customers,country,customer country
17,customers,continent,customer continent
18,customers,birthday,customer date of birth
19,products,productkey,primary key to identify products
20,products,product name,product name
21,products,brand,product brand
22,products,color,product color
23,products,unit cost usd,cost to produce the product in usd
24,products,unit price usd,product list price in usd
25,products,subcategorykey,key to identify product subcategories
26,products,subcategory,product subcategory name
27,products,categorykey,key to identify product categories
28,products,category,product category name
29,stores,storekey,primary key to identify stores
30,stores,country,store country
31,stores,state,store state
32,stores,square meters,store footprint in square meters
33,stores,open date,store open date
34,exchange rates,date,date
35,exchange rates,currency,currency code
36,exchange rates,exchange,exchange rate compared to usd

In [12]:
#dulicates
print(dataB.duplicated().sum())

0

In [13]:
print(dataB["Field"].unique())

['order number' 'line item' 'order date' 'delivery date' 'customerkey'
 'storekey' 'productkey' 'quantity' 'currency code' 'gender' 'name' 'city'
 'state code' 'state' 'zip code' 'country' 'continent' 'birthday'
 'product name' 'brand' 'color' 'unit cost usd' 'unit price usd'
 'subcategorykey' 'subcategory' 'categorykey' 'category' 'square meters'
 'open date' 'date' 'currency' 'exchange']

In [14]:
print(dataB["Description"].unique())

['unique id for each order'
 'identifies individual products purchased as part of an order'
 'date the order was placed' 'date the order was delivered'
 'unique key identifying which customer placed the order'
 'unique key identifying which store processed the order'
 'unique key identifying which product was purchased'
 'number of items purchased' 'currency used to process the order'
 'primary key to identify customers' 'customer gender'
 'customer full name' 'customer city' 'customer state abbreviated'
 'customer state full' 'customer zip code' 'customer country'
 'customer continent' 'customer date of birth'
 'primary key to identify products' 'product name' 'product brand'
 'product color' 'cost to produce the product in usd'
 'product list price in usd' 'key to identify product subcategories'
 'product subcategory name' 'key to identify product categories'
 'product category name' 'primary key to identify stores' 'store country'
 'store state' 'store footprint in square meters' 'store open date' 'date'
 'currency code' 'exchange rate compared to usd']

In [15]:
print(dataB["Table"].unique())

['sales' 'customers' 'products' 'stores' 'exchange rates']

In [18]:
dataB

,Table,Field,Description
0,Sales,Order Number,Unique Id For Each Order
1,Sales,Line Item,Identifies Individual Products Purchased As Pa...
2,Sales,Order Date,Date The Order Was Placed
3,Sales,Delivery Date,Date The Order Was Delivered
4,Sales,Customerkey,Unique Key Identifying Which Customer Placed T...
5,Sales,Storekey,Unique Key Identifying Which Store Processed T...
6,Sales,Productkey,Unique Key Identifying Which Product Was Purch...
7,Sales,Quantity,Number Of Items Purchased
8,Sales,Currency Code,Currency Used To Process The Order
9,Customers,Customerkey,Primary Key To Identify Customers
10,Customers,Gender,Customer Gender
11,Customers,Name,Customer Full Name
12,Customers,City,Customer City
13,Customers,State Code,Customer State Abbreviated
14,Customers,State,Customer State Full
15,Customers,Zip Code,Customer Zip Code
16,Customers,Country,Customer Country
17,Customers,Continent,Customer Continent
18,Customers,Birthday,Customer Date Of Birth
19,Products,Productkey,Primary Key To Identify Products
20,Products,Product Name,Product Name
21,Products,Brand,Product Brand
22,Products,Color,Product Color
23,Products,Unit Cost Usd,Cost To Produce The Product In Usd
24,Products,Unit Price Usd,Product List Price In Usd
25,Products,Subcategorykey,Key To Identify Product Subcategories
26,Products,Subcategory,Product Subcategory Name
27,Products,Categorykey,Key To Identify Product Categories
28,Products,Category,Product Category Name
29,Stores,Storekey,Primary Key To Identify Stores
30,Stores,Country,Store Country
31,Stores,State,Store State
32,Stores,Square Meters,Store Footprint In Square Meters
33,Stores,Open Date,Store Open Date
34,Exchange Rates,Date,Date
35,Exchange Rates,Currency,Currency Code
36,Exchange Rates,Exchange,Exchange Rate Compared To Usd

In [17]:
dataB["Field"]=dataB["Field"].str.title()
dataB["Table"]=dataB["Table"].str.title()
dataB["Description"]=dataB["Description"].str.title()

In [22]:
import pandas as pd  

dataB = pd.read_csv(r"C:\PARTHI\PROJECT - 2\Data_Dictionary.csv", encoding="latin1")

In [23]:
dataB.to_csv(r"C:\PARTHI\PROJECT - 2\Data_Dictionary_Cleaned.csv", index=False, encoding="latin1")

In [24]:
#dataA for small corecction
import pandas as pd

# Load the original CSV file
dataA = pd.read_csv(r"C:\PARTHI\PROJECT - 2\Customers.csv")

In [25]:
# Save the modified data as a new file (keeping the original intact)
dataA.to_csv(r"C:\PARTHI\PROJECT - 2\Customers_Modified.csv", index=False)
print("Modified CSV saved as 'Customers_Modified.csv'. Original file remains unchanged.")

Modified CSV saved as 'Customers_Modified.csv'. Original file remains unchanged.

In [26]:
dataA

,CustomerKey,Gender,Name,City,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,Wandearah East,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,Mount Budd,Western Australia,6522,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,Winjallok,Victoria,3380,Australia,Australia,1947-05-26
3,786,Male,Jai Poltpalingada,Middle River,South Australia,5223,Australia,Australia,1957-09-17
4,1042,Male,Aidan Pankhurst,Tawonga South,Victoria,3698,Australia,Australia,1965-11-19
...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa DuâKovã¡,Houston,Texas,77017,United States,North America,1936-03-25
15262,2099618,Male,Justin Solã³Rzano,Mclean,Virginia,22101,United States,North America,1992-02-16
15263,2099758,Male,Svend Petrussen,Wilmington,North Carolina,28405,United States,North America,1937-11-09
15264,2099862,Female,Lorenza Rush,Riverside,California,92501,United States,North America,1937-10-12
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,Michigan,48302,United States,North America,1965-08-18

In [27]:
#dataC
import pandas as pd
#read csv file
datac = pd.read_csv(r"C:\PARTHI\PROJECT - 2\Exchange_Rates.csv", encoding="latin1")

In [29]:
datac

            Date Currency  Exchange
0       1/1/2015      USD    1.0000
1       1/1/2015      CAD    1.1583
2       1/1/2015      AUD    1.2214
3       1/1/2015      EUR    0.8237
4       1/1/2015      GBP    0.6415
...          ...      ...       ...
11210  2/20/2021      USD    1.0000
11211  2/20/2021      CAD    1.2610
11212  2/20/2021      AUD    1.2723
11213  2/20/2021      EUR    0.8238
11214  2/20/2021      GBP    0.7126

[11215 rows x 3 columns]

In [33]:
print(datac.dtypes)

Date        datetime64[ns]
Currency            object
Exchange           float64
dtype: object

In [32]:
datac['Date'] = pd.to_datetime(datac['Date'])

In [34]:
print(datac['Currency'].unique())

['USD' 'CAD' 'AUD' 'EUR' 'GBP']

In [35]:
print(datac.isnull().sum())

Date        0
Currency    0
Exchange    0
dtype: int64

In [36]:
print(datac.duplicated().sum())

0

In [39]:
# Remove extra spaces
datac['Currency'] = datac['Currency'].str.strip()

In [40]:
datac

            Date Currency  Exchange
0     2015-01-01      USD    1.0000
1     2015-01-01      CAD    1.1583
2     2015-01-01      AUD    1.2214
3     2015-01-01      EUR    0.8237
4     2015-01-01      GBP    0.6415
...          ...      ...       ...
11210 2021-02-20      USD    1.0000
11211 2021-02-20      CAD    1.2610
11212 2021-02-20      AUD    1.2723
11213 2021-02-20      EUR    0.8238
11214 2021-02-20      GBP    0.7126

[11215 rows x 3 columns]

In [41]:
datac.to_csv("Cleaned_Exchange_Rates.csv", index=False)

In [42]:
datac.to_csv(r"C:\PARTHI\PROJECT - 2\Exchange_Rates_Cleaned.csv", index=False, encoding="latin1")

In [73]:
#dataD
import pandas as pd
dataD=pd.read_csv(r"C:\PARTHI\PROJECT - 2\Products.csv",encoding="latin1")

In [74]:
dataD

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...,...
2512,2513,Contoso Bluetooth Active Headphones L15 Red,Contoso,Red,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2513,2514,Contoso Bluetooth Active Headphones L15 White,Contoso,White,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2514,2515,Contoso In-Line Coupler E180 White,Contoso,White,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2515,2516,Contoso In-Line Coupler E180 Black,Contoso,Black,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2516,2517,Contoso In-Line Coupler E180 Silver,Contoso,Silver,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones

In [75]:
#data type
print(dataD.dtypes)

ProductKey         int64
Product Name      object
Brand             object
Color             object
Unit Cost USD     object
Unit Price USD    object
SubcategoryKey     int64
Subcategory       object
CategoryKey        int64
Category          object
dtype: object

In [76]:
dataD.duplicated().sum()

np.int64(0)

In [77]:
dataD.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [78]:
dataD.columns = dataD.columns.str.strip()
dataD['Product Name'] = dataD['Product Name'].str.strip()

In [65]:
dataD

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...,...
2512,2513,Contoso Bluetooth Active Headphones L15 Red,Contoso,Red,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2513,2514,Contoso Bluetooth Active Headphones L15 White,Contoso,White,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2514,2515,Contoso In-Line Coupler E180 White,Contoso,White,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2515,2516,Contoso In-Line Coupler E180 Black,Contoso,Black,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2516,2517,Contoso In-Line Coupler E180 Silver,Contoso,Silver,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones

In [79]:
dataD['Product Name'] = dataD['Product Name'].str.lower()

In [67]:
dataD

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,contoso 512mb mp3 player e51 silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,contoso 512mb mp3 player e51 blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,contoso 1g mp3 player e100 white,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,contoso 2g mp3 player e200 silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,contoso 2g mp3 player e200 red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...,...
2512,2513,contoso bluetooth active headphones l15 red,Contoso,Red,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2513,2514,contoso bluetooth active headphones l15 white,Contoso,White,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2514,2515,contoso in-line coupler e180 white,Contoso,White,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2515,2516,contoso in-line coupler e180 black,Contoso,Black,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2516,2517,contoso in-line coupler e180 silver,Contoso,Silver,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones

In [80]:
dataD['Product Name'] = dataD['Product Name'].str.title()
dataD['Brand'] = dataD['Brand'].str.title()
dataD['Color'] = dataD['Color'].str.title()
dataD['Category'] = dataD['Category'].str.title()

In [81]:
dataD

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512Mb Mp3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512Mb Mp3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G Mp3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G Mp3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G Mp3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...,...
2512,2513,Contoso Bluetooth Active Headphones L15 Red,Contoso,Red,$43.07,$129.99,505,Cell phones Accessories,5,Cell Phones
2513,2514,Contoso Bluetooth Active Headphones L15 White,Contoso,White,$43.07,$129.99,505,Cell phones Accessories,5,Cell Phones
2514,2515,Contoso In-Line Coupler E180 White,Contoso,White,$1.71,$3.35,505,Cell phones Accessories,5,Cell Phones
2515,2516,Contoso In-Line Coupler E180 Black,Contoso,Black,$1.71,$3.35,505,Cell phones Accessories,5,Cell Phones
2516,2517,Contoso In-Line Coupler E180 Silver,Contoso,Silver,$1.71,$3.35,505,Cell phones Accessories,5,Cell Phones

In [82]:
print(dataD.dtypes)

ProductKey         int64
Product Name      object
Brand             object
Color             object
Unit Cost USD     object
Unit Price USD    object
SubcategoryKey     int64
Subcategory       object
CategoryKey        int64
Category          object
dtype: object

In [83]:
for col in dataD.columns:
    print(f"{col}: {dataD[col].nunique()} unique values")

ProductKey: 2517 unique values
Product Name: 2517 unique values
Brand: 11 unique values
Color: 16 unique values
Unit Cost USD: 480 unique values
Unit Price USD: 426 unique values
SubcategoryKey: 32 unique values
Subcategory: 32 unique values
CategoryKey: 8 unique values
Category: 8 unique values

In [85]:
dataD['Unit Price USD'] = dataD['Unit Price USD'].str.replace('[\$,]', '', regex=True).str.strip().astype(float)

<>:1: SyntaxWarning: invalid escape sequence '\$'
<>:1: SyntaxWarning: invalid escape sequence '\$'
C:\Users\loges\AppData\Local\Temp\ipykernel_20132\2999617107.py:1: SyntaxWarning: invalid escape sequence '\$'
  dataD['Unit Price USD'] = dataD['Unit Price USD'].str.replace('[\$,]', '', regex=True).str.strip().astype(float)

In [90]:
dataD['Unit Cost USD'] = dataD['Unit Cost USD'].str.replace('[\$,]', '', regex=True).str.strip().astype(float)

<>:1: SyntaxWarning: invalid escape sequence '\$'
<>:1: SyntaxWarning: invalid escape sequence '\$'
C:\Users\loges\AppData\Local\Temp\ipykernel_20132\2854506910.py:1: SyntaxWarning: invalid escape sequence '\$'
  dataD['Unit Cost USD'] = dataD['Unit Cost USD'].str.replace('[\$,]', '', regex=True).str.strip().astype(float)

In [93]:
dataD

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512Mb Mp3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512Mb Mp3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G Mp3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G Mp3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G Mp3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...,...
2512,2513,Contoso Bluetooth Active Headphones L15 Red,Contoso,Red,43.07,129.99,505,Cell phones Accessories,5,Cell Phones
2513,2514,Contoso Bluetooth Active Headphones L15 White,Contoso,White,43.07,129.99,505,Cell phones Accessories,5,Cell Phones
2514,2515,Contoso In-Line Coupler E180 White,Contoso,White,1.71,3.35,505,Cell phones Accessories,5,Cell Phones
2515,2516,Contoso In-Line Coupler E180 Black,Contoso,Black,1.71,3.35,505,Cell phones Accessories,5,Cell Phones
2516,2517,Contoso In-Line Coupler E180 Silver,Contoso,Silver,1.71,3.35,505,Cell phones Accessories,5,Cell Phones

In [92]:
dataD.dtypes

ProductKey          int64
Product Name       object
Brand              object
Color              object
Unit Cost USD     float64
Unit Price USD    float64
SubcategoryKey      int64
Subcategory        object
CategoryKey         int64
Category           object
dtype: object

In [94]:
dataD.to_csv(r"C:\PARTHI\PROJECT - 2\Products_Cleaned.csv", index=False, encoding="latin1")

In [95]:
#dataE
import pandas as pd
dataE=pd.read_csv(r"C:\PARTHI\PROJECT - 2\Sales.csv",encoding="latin1")

In [101]:
dataE.dtypes

Order Number              int64
Line Item                 int64
Order Date       datetime64[ns]
Delivery Date    datetime64[ns]
CustomerKey               int64
StoreKey                  int64
ProductKey                int64
Quantity                  int64
Currency Code            object
dtype: object

In [97]:
dataE

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2/20/2021,NaN,1216913,43,632,3,USD
62880,2243031,1,2/20/2021,2/24/2021,511229,0,98,4,EUR
62881,2243032,1,2/20/2021,2/23/2021,331277,0,1613,2,CAD
62882,2243032,2,2/20/2021,2/23/2021,331277,0,1717,2,CAD
62883,2243032,3,2/20/2021,2/23/2021,331277,0,464,7,CAD

In [98]:
dataE['Order Date'] = pd.to_datetime(dataE['Order Date'])

In [100]:
dataE['Delivery Date'] = pd.to_datetime(dataE['Delivery Date'])

In [102]:
for col in dataE.columns:
    print(f"{col}: {dataE[col].nunique()} unique values")

Order Number: 26326 unique values
Line Item: 7 unique values
Order Date: 1641 unique values
Delivery Date: 1492 unique values
CustomerKey: 11887 unique values
StoreKey: 58 unique values
ProductKey: 2492 unique values
Quantity: 10 unique values
Currency Code: 5 unique values

In [104]:
dataE['CustomerKey'].unique().sum()

np.int64(13199230588)

In [105]:
print(dataE.isnull().sum())

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

In [106]:
dataE

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,NaT,265598,10,1304,1,CAD
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD
3,366002,1,2016-01-01,2016-01-12,266019,0,1106,7,CAD
4,366002,2,2016-01-01,2016-01-12,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2021-02-20,NaT,1216913,43,632,3,USD
62880,2243031,1,2021-02-20,2021-02-24,511229,0,98,4,EUR
62881,2243032,1,2021-02-20,2021-02-23,331277,0,1613,2,CAD
62882,2243032,2,2021-02-20,2021-02-23,331277,0,1717,2,CAD
62883,2243032,3,2021-02-20,2021-02-23,331277,0,464,7,CAD

In [108]:
print(dataE['Delivery Date'])

0              NaT
1       2016-01-13
2       2016-01-13
3       2016-01-12
4       2016-01-12
           ...
62879          NaT
62880   2021-02-24
62881   2021-02-23
62882   2021-02-23
62883   2021-02-23
Name: Delivery Date, Length: 62884, dtype: datetime64[ns]

In [115]:
print(dataE.loc[dataE['Delivery Date'].isna(), ['Order Date', 'Delivery Date']])

      Order Date Delivery Date
0     2016-01-01           NaT
6     2016-01-01           NaT
7     2016-01-01           NaT
8     2016-01-01           NaT
9     2016-01-01           NaT
...          ...           ...
62867 2021-02-20           NaT
62868 2021-02-20           NaT
62869 2021-02-20           NaT
62872 2021-02-20           NaT
62879 2021-02-20           NaT

[49719 rows x 2 columns]

In [117]:
dataE['Currency Code'].unique()

array(['CAD', 'USD', 'GBP', 'EUR', 'AUD'], dtype=object)

In [118]:
# Apply the condition and fill NaN values in Delivery Date
dataE.loc[
    (dataE['Delivery Date'].isna()) & (dataE['Currency Code'].isin(['USD', 'AUD'])), 
    'Delivery Date'
] = dataE['Order Date'] + pd.Timedelta(days=10)

# Display updated DataFrame
print(dataE[['Order Date', 'Delivery Date', 'Currency Code']])

      Order Date Delivery Date Currency Code
0     2016-01-01           NaT           CAD
1     2016-01-01    2016-01-13           USD
2     2016-01-01    2016-01-13           USD
3     2016-01-01    2016-01-12           CAD
4     2016-01-01    2016-01-12           CAD
...          ...           ...           ...
62879 2021-02-20    2021-03-02           USD
62880 2021-02-20    2021-02-24           EUR
62881 2021-02-20    2021-02-23           CAD
62882 2021-02-20    2021-02-23           CAD
62883 2021-02-20    2021-02-23           CAD

[62884 rows x 3 columns]

In [123]:
print(dataE.isnull().sum())

Order Number     0
Line Item        0
Order Date       0
Delivery Date    0
CustomerKey      0
StoreKey         0
ProductKey       0
Quantity         0
Currency Code    0
dtype: int64

In [120]:
dataE.loc[
    (dataE['Delivery Date'].isna()) & (dataE['Currency Code'].isin(['EUR', 'GBP'])), 
    'Delivery Date'
] = dataE['Order Date'] + pd.Timedelta(days=7)

In [122]:
dataE.loc[
    (dataE['Delivery Date'].isna()) & (dataE['Currency Code'].isin(['CAD'])), 
    'Delivery Date'
] = dataE['Order Date'] + pd.Timedelta(days=8)

In [124]:
dataE

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,2016-01-09,265598,10,1304,1,CAD
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD
3,366002,1,2016-01-01,2016-01-12,266019,0,1106,7,CAD
4,366002,2,2016-01-01,2016-01-12,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2021-02-20,2021-03-02,1216913,43,632,3,USD
62880,2243031,1,2021-02-20,2021-02-24,511229,0,98,4,EUR
62881,2243032,1,2021-02-20,2021-02-23,331277,0,1613,2,CAD
62882,2243032,2,2021-02-20,2021-02-23,331277,0,1717,2,CAD
62883,2243032,3,2021-02-20,2021-02-23,331277,0,464,7,CAD

In [125]:
dataD.to_csv(r"C:\PARTHI\PROJECT - 2\Sales_Cleaned.csv", index=False, encoding="latin1")

In [ ]:
#dataF
dataF=pd.read_csv(r"C:\PARTHI\PROJECT - 2\Stores.csv", encoding="latin1")

In [127]:
dataF

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,1/1/2008
1,2,Australia,Northern Territory,665.0,1/12/2008
2,3,Australia,South Australia,2000.0,1/7/2012
3,4,Australia,Tasmania,2000.0,1/1/2010
4,5,Australia,Victoria,2000.0,12/9/2015
...,...,...,...,...,...
62,63,United States,Utah,2000.0,3/6/2008
63,64,United States,Washington DC,1330.0,1/1/2010
64,65,United States,West Virginia,1785.0,1/1/2012
65,66,United States,Wyoming,840.0,1/1/2014
66,0,Online,Online,NaN,1/1/2010

In [131]:
dataF.dtypes

StoreKey                  int64
Country                  object
State                    object
Square Meters           float64
Open Date        datetime64[ns]
dtype: object

In [130]:
dataF['Open Date'] = pd.to_datetime(dataF['Open Date'])

In [134]:
print(dataF['StoreKey'].unique())

[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48
 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66  0]

In [137]:
print(dataF.isnull().sum())

StoreKey         0
Country          0
State            0
Square Meters    0
Open Date        0
dtype: int64

In [136]:
dataF.dropna(subset=['Square Meters'],inplace=True)

In [140]:
dataF.duplicated().sum()

np.int64(0)

In [145]:
dataF

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,2008-01-01
1,2,Australia,Northern Territory,665.0,2008-01-12
2,3,Australia,South Australia,2000.0,2012-01-07
3,4,Australia,Tasmania,2000.0,2010-01-01
4,5,Australia,Victoria,2000.0,2015-12-09
...,...,...,...,...,...
61,62,United States,South Dakota,1120.0,2018-06-03
62,63,United States,Utah,2000.0,2008-03-06
63,64,United States,Washington DC,1330.0,2010-01-01
64,65,United States,West Virginia,1785.0,2012-01-01
65,66,United States,Wyoming,840.0,2014-01-01

In [146]:
dataF.columns = dataF.columns.str.strip()
dataF['Country'] = dataF['Country'].str.strip()
dataF.columns = dataF.columns.str.strip()
dataF['State'] = dataF['State'].str.strip()

In [148]:
dataF['Country'] = dataF['Country'].str.lower()
dataF['State'] = dataF['State'].str.lower()

In [151]:
dataF

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,2008-01-01
1,2,Australia,Northern Territory,665.0,2008-01-12
2,3,Australia,South Australia,2000.0,2012-01-07
3,4,Australia,Tasmania,2000.0,2010-01-01
4,5,Australia,Victoria,2000.0,2015-12-09
...,...,...,...,...,...
61,62,United States,South Dakota,1120.0,2018-06-03
62,63,United States,Utah,2000.0,2008-03-06
63,64,United States,Washington Dc,1330.0,2010-01-01
64,65,United States,West Virginia,1785.0,2012-01-01
65,66,United States,Wyoming,840.0,2014-01-01

In [150]:
dataF['Country'] = dataF['Country'].str.title()
dataF['State'] = dataF['State'].str.title()

In [152]:
dataF.to_csv(r"C:\PARTHI\PROJECT - 2\Stores_Cleaned.csv", index=False, encoding="latin1")